In [1]:
# Importing pandas and numpy Libraries
import pandas as pd
import numpy as np

In [2]:
Data = pd.read_csv("26_grouping_data.csv")
Data

         date website     traffic  number(m)
0   3/21/2017  amazon  promotions         20
1   3/21/2017  amazon         ads         30
2   3/21/2017  amazon      search         40
3   3/22/2017  amazon  promotions         30
4   3/22/2017  amazon         ads         40
5   3/22/2017  amazon      search         50
6   3/23/2017   yahoo  promotions         10
7   3/23/2017   yahoo         ads         15
8   3/23/2017   yahoo      search         20
9   3/24/2017   yahoo  promotions         15
10  3/24/2017   yahoo         ads         20
11  3/24/2017   yahoo      search         30

In [14]:
# SAC (spilit-apply-combine)
# Grouping data by website.
V1 = Data.groupby('website')
V1

In [15]:
V1.ngroups # total numbers of groups

2

In [16]:
V1.groups # shows index

{'amazon': Int64Index([0, 1, 2, 3, 4, 5], dtype='int64'),
 'yahoo': Int64Index([6, 7, 8, 9, 10, 11], dtype='int64')}

In [17]:
V1.size()

website
amazon    6
yahoo     6
dtype: int64

In [18]:
V1.count()

         date  traffic  number(m)
website
amazon      6        6          6
yahoo       6        6          6

In [19]:
V1.get_group('yahoo')

         date website     traffic  number(m)
6   3/23/2017   yahoo  promotions         10
7   3/23/2017   yahoo         ads         15
8   3/23/2017   yahoo      search         20
9   3/24/2017   yahoo  promotions         15
10  3/24/2017   yahoo         ads         20
11  3/24/2017   yahoo      search         30

In [20]:
V1.get_group('amazon')

        date website     traffic  number(m)
0  3/21/2017  amazon  promotions         20
1  3/21/2017  amazon         ads         30
2  3/21/2017  amazon      search         40
3  3/22/2017  amazon  promotions         30
4  3/22/2017  amazon         ads         40
5  3/22/2017  amazon      search         50

In [21]:
V1.head(2)

        date website     traffic  number(m)
0  3/21/2017  amazon  promotions         20
1  3/21/2017  amazon         ads         30
6  3/23/2017   yahoo  promotions         10
7  3/23/2017   yahoo         ads         15

In [22]:
V1.tail(1)

         date website traffic  number(m)
5   3/22/2017  amazon  search         50
11  3/24/2017   yahoo  search         30

In [23]:
V1.nth(2)

              date traffic  number(m)
website
amazon   3/21/2017  search         40
yahoo    3/23/2017  search         20

In [24]:
V2 = Data.groupby(['website', 'traffic'])
V2

In [25]:
V2.count()

                    date  number(m)
website traffic
amazon  ads            2          2
        promotions     2          2
        search         2          2
yahoo   ads            2          2
        promotions     2          2
        search         2          2

In [26]:
V2.nth(1)

                         date  number(m)
website traffic
amazon  ads         3/22/2017         40
        promotions  3/22/2017         30
        search      3/22/2017         50
yahoo   ads         3/24/2017         20
        promotions  3/24/2017         15
        search      3/24/2017         30

In [27]:
V2.ngroups

6

In [29]:
V2.head(1)

        date website     traffic  number(m)
0  3/21/2017  amazon  promotions         20
1  3/21/2017  amazon         ads         30
2  3/21/2017  amazon      search         40
6  3/23/2017   yahoo  promotions         10
7  3/23/2017   yahoo         ads         15
8  3/23/2017   yahoo      search         20